meshStudy/draftCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type          forces;

        libs          ("libforces.so");

        writeControl  timeStep;
        timeInterval  1;

        log           yes;

        patches       (stirrer shaft);
        rho           rhoInf;     // Indicates incompressible
        log           true;
        rhoInf        1;          // Redundant for incompressible

        CofR          (0 0 0);    // Rotation around centre line of propeller
        pitchAxis     (0 0 1);
    }
}

// ************************************************************************* //
